# 1.輸入月份1~12月，判斷相對應的季節春、夏、秋、冬並印出。若不在此範圍則印出”輸入錯誤”。

number = input("請輸入月份1~12月:")

if number in ["1", "2", "3"]:
    print("冬")
elif number in ["4", "5", "6"]:
    print("春")
elif number in ["7", "8", "9"]:
    print("夏")
elif number in ["10", "11", "12"]:
    print("秋")
else:
    print("輸入錯誤")

# 2.輸入便利商店工讀生的工作時數，並計算其薪資。
# 60小時以內，時薪160元。
# 61~80小時，以時薪1.25倍計算。
# 81小時以上，以時薪1.5倍計算。

work_hour = int(input("輸入工讀生的工作時數，以計算薪資:"))

if work_hour <= 60:
    print("薪資為:", 160*work_hour)

elif 61 <= work_hour <= 80:
    print("薪資為:", 60*160 + (work_hour-60)*160*1.25)

else:
    print("薪資為:", 60*160 + 20*160*1.25 + (work_hour-80)*160*1.5)

# 3. 輸入何種用電和度數，計算出需繳之電費。
# 電力公司使用累計方式來計算電費，分工業用電及家庭用電。
#                      家庭用電        工業用電
#  120度(含)以下         1.63元          0.5元
#  121~330(含)度        2.38元          0.5元
#  330度以上            3.52元          0.5元

elc_cls = input("何種用電(家庭用電/工業用電)?")
elc_num = int(input("請輸入用電度數?"))

if elc_cls == "家庭用電":
    if elc_num <= 120:
        print("需繳電費為:", elc_num*1.63, "元")
    elif 121 <= elc_num <= 330:
        print("需繳電費為:", 120*1.63 + (elc_num-120)*2.38, "元")
    elif 330 < elc_num:
        print("需繳電費為:", 120*1.63+210*2.38+(elc_num-330)*3.52, "元")
else:
    print("需繳電費為:", elc_num*0.5, "元")

# 4.輸入在某商店購物應付金額與實付金額。
# 實付金額小於應付金額，則印出”金額不足”。
# 實付金額等於應付金額，則印出”不必找錢”。
# 實付金額大於應付金額，則輸出找回金額最少的鈔票數和錢幣數。
# 假設幣值只有1000, 500, 100元紙鈔和50, 10, 5, 1元硬幣。
# 說明：若買了132元的商品，付1000元，應找回一張500元，三張100元，一個50元硬幣，一個10元硬幣，一個5元硬幣和三個1元硬幣。

Amt_Pyb = int(input("請輸入應付金額:"))
Amt_Paid = int(input("請輸入實付金額:"))
x = Amt_Paid - Amt_Pyb
if x < 0:
    print("金額不足!")
elif x == 0:
    print("不必找錢")
else:
    print("應找:")
    print("1000元:", x//1000, "張；\t", "500元:", (x%1000)//500, "張；\t", "100元:", ((x%1000)%500)//100, "張；\t",
          "50元:", (((x%1000)%500)%100)//50, "個；\t", "10元:", ((((x%1000)%500)%100)%50)//10, "個；\t",
          "5元:", (((((x%1000)%500)%100)%50)%10)//5, "個；\t", "1元:", (((((x%1000)%500)%100)%50)%10)%5, "個")

# 5.迴圏的練習-password
# 出現”請輸入密碼”的提示，使用者有最多三次輸入的機會。
# 若輸入正確，則印出”密碼輸入正確，歡迎使用本系統！”。
# 若輸入不正確，再次出現”請輸入密碼”的提示。
# 若三次輸入不正確，則印出”密碼輸入超過三次！”，並結束程式的執行。

correct_pwd = 12345
pwd = int(input("請輸入密碼:"))
n = 1
while n < 4:
    if pwd == correct_pwd:
        print("密碼輸入正確，歡迎使用本系統!")
        break
    else:
        if 1 <= n <= 2:
            pwd = int(input("請輸入密碼:"))
            n += 1
        else:
            print("密碼輸入超過三次!")
            break

